specifications/trinity/trinity.org
#+TITLE: Trinity Engine Canon Extract
#+DATE: 2026-03-24

* Overview
- Trinity Engine v1 is a deterministic, stateless calculation engine.
- Governing implementation canon: Documents 01-08 and 11.
- Test canon: Document 10.
- Control and transparency documents: Document 00, Document 09, Document 12.
- Canon precedence order:
  - Document 04 Input Specification
  - Document 05 Calculation Canon
  - Document 06 Mapping Canon
  - Document 07 Output Specification
  - Document 03 Canonical Source Stack
  - Document 02 Supported Objects and Scope
  - Document 01 Purpose and System Boundary
  - Document 09 Ambiguity Register
  - Document 00 Canon Build Status

* Package State
- Document 00: Draft control document.
- Document 01: Near Final.
- Document 02: Near Final.
- Document 03: Near Final.
- Document 04: Final.
- Document 05: Near Final.
- Document 06: Near Final.
- Document 07: Near Final.
- Document 08: Near Final.
- Document 09: Draft Approved, actively in use.
- Document 10: Draft Approved, awaiting fixture population.
- Document 11: Near Final.
- Major active package risk recorded in the canon itself: final consistency pass across Documents 05, 06, and 07.

* Scope And Boundary
- In scope:
  - input validation against canonical normalized input
  - astrology calculations
  - Human Design calculations
  - Gene Keys derivation
  - application of pinned mappings, thresholds, ordering, and formatting
  - structured success and error responses
  - deterministic metadata for reproducibility
- Out of scope:
  - birthplace search, geocoding, and timezone determination
  - UI and presentation behavior
  - persistence and operational logging
  - narrative, content, recommendations, coaching, and translation
  - any calculation or output not explicitly enumerated in the canon
- Supported domains:
  - Astrology
  - Human Design
  - Gene Keys
- No separate "Trinity derived calculations" category exists in v1.
- Engine boundary rule:
  - input reaches the engine only after normalization
  - raw birthplace strings, unresolved timezone data, free-text dates/times, and ambiguous location data are outside scope

* Authoritative Sources And Version Pins
- Swiss Ephemeris is the authoritative astronomical source.
- Swiss Ephemeris version pin: =2.10.03=.
- IANA Time Zone Database is the authoritative timezone standard.
- Gregorian calendar is the authoritative civil calendar basis.
- Tropical zodiac is authoritative across domains.
- Placidus is the authoritative astrology house system.
- Node policy by domain:
  - Astrology uses Mean Node.
  - Human Design uses True Node.
  - Gene Keys inherits the Human Design basis.
- External libraries are implementation vehicles only; library defaults are non-authoritative unless canon explicitly adopts them.
- Third-party platforms may be used only for sanity checking, not as truth.

* Supported Objects And Outputs
** Astrology
- Raw objects:
  - sun
  - moon
  - mercury
  - venus
  - mars
  - jupiter
  - saturn
  - uranus
  - neptune
  - pluto
  - chiron
  - north_node_mean
  - earth
- Additional supported outputs:
  - ascendant
  - midheaven
  - house cusps 1-12
- Per-object supported attributes:
  - object_id
  - longitude
  - sign
  - house
- Explicitly out of scope:
  - aspects
  - dignities
  - dispositors
  - house rulers
  - elemental or modality synthesis
  - asteroids beyond Chiron
  - fixed stars
  - interpretive text

** Human Design
- Two snapshots:
  - personality at birth
  - design at design_time_utc
- Snapshot object identifiers and order:
  1. sun
  2. earth
  3. north_node
  4. south_node
  5. moon
  6. mercury
  7. venus
  8. mars
  9. jupiter
  10. saturn
  11. uranus
  12. neptune
  13. pluto
- Activation output for each snapshot object:
  - object_id
  - gate
  - line
- Structural outputs:
  - channels
  - centers
  - definition
  - type
  - authority
  - profile
  - incarnation_cross

** Gene Keys
- Not an independent astronomical system.
- Derived strictly from Human Design gate and line outputs.
- Supported positions:
  - life_work = Personality Sun
  - evolution = Personality Earth
  - radiance = Design Sun
  - purpose = Design Earth
- Supported fields per position:
  - key
  - line
- Out of scope:
  - shadow, gift, and essence text
  - sequence prose
  - semantic states

* Input Contract
** Canonical Payload
- One person per payload.
- Required fields:
  | field      | type   | format / rule                  |
  |------------+--------+--------------------------------|
  | birth_date | string | YYYY-MM-DD                     |
  | birth_time | string | HH:MM, 24-hour, minute only    |
  | timezone   | string | IANA timezone identifier       |
  | latitude   | number | decimal degrees, -90.0..90.0   |
  | longitude  | number | decimal degrees, -180.0..180.0 |
- Canonical logical shape:
#+begin_src json
{
  "birth_date": "YYYY-MM-DD",
  "birth_time": "HH:MM",
  "timezone": "Area/Location",
  "latitude": 0.000000,
  "longitude": 0.000000
}
#+end_src

** Validation Rules
- Validate before any calculation:
  - presence of all required fields
  - exact field format compliance
  - type compliance
  - numeric range compliance
  - IANA-compliant timezone format
  - Gregorian date validity
  - 24-hour minute time validity
- Strict numeric typing:
  - numeric fields must be numeric values, not strings
  - no silent coercion of numeric-looking strings
- No optional canonical input fields in v1.
- Extra upstream fields are non-authoritative and must not affect results.

** Normalization Assumptions
- Before engine submission:
  - location already resolved to unique latitude and longitude
  - timezone already resolved to a valid IANA identifier
  - date already resolved to Gregorian YYYY-MM-DD
  - time already normalized to HH:MM
  - ambiguity, alias handling, and UI cleaning already completed upstream
  - payload already reduced to one birth event

** Rejection Rules
- =incomplete_input=
  - missing one or more required fields
- =invalid_input=
  - malformed date or time
  - invalid timezone string
  - out-of-range latitude or longitude
  - numeric field supplied as string
- =unsupported_input=
  - structurally valid input outside supported v1 scope

** No Silent Repair
- The engine must not silently:
  - infer missing fields
  - correct malformed values
  - coerce ambiguous inputs
  - map timezone aliases
  - resolve place names
  - truncate unexpected time formats
  - substitute defaults

* Calculation Canon
