specifications/trinity/trinity.tex
% Created 2026-03-24 Tue 20:33
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Pascal Bourguignon}
\date{2026-03-24}
\title{Trinity Engine Canon Extract}
\hypersetup{
 pdfauthor={Pascal Bourguignon},
 pdftitle={Trinity Engine Canon Extract},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Overview}
\label{sec:org42dc89e}
\begin{itemize}
\item Trinity Engine v1 is a deterministic, stateless calculation engine.
\item Governing implementation canon: Documents 01-08 and 11.
\item Test canon: Document 10.
\item Control and transparency documents: Document 00, Document 09, Document 12.
\item Canon precedence order:
\begin{itemize}
\item Document 04 Input Specification
\item Document 05 Calculation Canon
\item Document 06 Mapping Canon
\item Document 07 Output Specification
\item Document 03 Canonical Source Stack
\item Document 02 Supported Objects and Scope
\item Document 01 Purpose and System Boundary
\item Document 09 Ambiguity Register
\item Document 00 Canon Build Status
\end{itemize}
\end{itemize}
\section{Package State}
\label{sec:org10738c0}
\begin{itemize}
\item Document 00: Draft control document.
\item Document 01: Near Final.
\item Document 02: Near Final.
\item Document 03: Near Final.
\item Document 04: Final.
\item Document 05: Near Final.
\item Document 06: Near Final.
\item Document 07: Near Final.
\item Document 08: Near Final.
\item Document 09: Draft Approved, actively in use.
\item Document 10: Draft Approved, awaiting fixture population.
\item Document 11: Near Final.
\item Major active package risk recorded in the canon itself: final consistency pass across Documents 05, 06, and 07.
\end{itemize}
\section{Scope And Boundary}
\label{sec:org134b9ea}
\begin{itemize}
\item In scope:
\begin{itemize}
\item input validation against canonical normalized input
\item astrology calculations
\item Human Design calculations
\item Gene Keys derivation
\item application of pinned mappings, thresholds, ordering, and formatting
\item structured success and error responses
\item deterministic metadata for reproducibility
\end{itemize}
\item Out of scope:
\begin{itemize}
\item birthplace search, geocoding, and timezone determination
\item UI and presentation behavior
\item persistence and operational logging
\item narrative, content, recommendations, coaching, and translation
\item any calculation or output not explicitly enumerated in the canon
\end{itemize}
\item Supported domains:
\begin{itemize}
\item Astrology
\item Human Design
\item Gene Keys
\end{itemize}
\item No separate "Trinity derived calculations" category exists in v1.
\item Engine boundary rule:
\begin{itemize}
\item input reaches the engine only after normalization
\item raw birthplace strings, unresolved timezone data, free-text dates/times, and ambiguous location data are outside scope
\end{itemize}
\end{itemize}
\section{Authoritative Sources And Version Pins}
\label{sec:orgb97f8b4}
\begin{itemize}
\item Swiss Ephemeris is the authoritative astronomical source.
\item Swiss Ephemeris version pin: \texttt{2.10.03}.
\item IANA Time Zone Database is the authoritative timezone standard.
\item Gregorian calendar is the authoritative civil calendar basis.
\item Tropical zodiac is authoritative across domains.
\item Placidus is the authoritative astrology house system.
\item Node policy by domain:
\begin{itemize}
\item Astrology uses Mean Node.
\item Human Design uses True Node.
\item Gene Keys inherits the Human Design basis.
\end{itemize}
\item External libraries are implementation vehicles only; library defaults are non-authoritative unless canon explicitly adopts them.
\item Third-party platforms may be used only for sanity checking, not as truth.
\end{itemize}
\section{Supported Objects And Outputs}
\label{sec:org4cafe82}
\subsection{Astrology}
\label{sec:orgfc2dc9d}
\begin{itemize}
\item Raw objects:
\begin{itemize}
\item sun
\item moon
\item mercury
\item venus
\item mars
\item jupiter
\item saturn
\item uranus
\item neptune
\item pluto
\item chiron
\item north\textsubscript{node}\textsubscript{mean}
\item earth
\end{itemize}
\item Additional supported outputs:
\begin{itemize}
\item ascendant
\item midheaven
\item house cusps 1-12
\end{itemize}
\item Per-object supported attributes:
\begin{itemize}
\item object\textsubscript{id}
\item longitude
\item sign
\item house
\end{itemize}
\item Explicitly out of scope:
\begin{itemize}
\item aspects
\item dignities
\item dispositors
\item house rulers
\item elemental or modality synthesis
\item asteroids beyond Chiron
\item fixed stars
\item interpretive text
\end{itemize}
\end{itemize}
\subsection{Human Design}
\label{sec:org622c0ea}
\begin{itemize}
\item Two snapshots:
\begin{itemize}
\item personality at birth
\item design at design\textsubscript{time}\textsubscript{utc}
\end{itemize}
\item Snapshot object identifiers and order:
\begin{enumerate}
\item sun
\item earth
\item north\textsubscript{node}
\item south\textsubscript{node}
\item moon
\item mercury
\item venus
\item mars
\item jupiter
\item saturn
\item uranus
\item neptune
\item pluto
\end{enumerate}
\item Activation output for each snapshot object:
\begin{itemize}
\item object\textsubscript{id}
\item gate
\item line
\end{itemize}
\item Structural outputs:
\begin{itemize}
\item channels
\item centers
\item definition
\item type
\item authority
\item profile
\item incarnation\textsubscript{cross}
\end{itemize}
\end{itemize}
\subsection{Gene Keys}
\label{sec:org77c55f7}
\begin{itemize}
\item Not an independent astronomical system.
\item Derived strictly from Human Design gate and line outputs.
\item Supported positions:
\begin{itemize}
\item life\textsubscript{work} = Personality Sun
\item evolution = Personality Earth
\item radiance = Design Sun
\item purpose = Design Earth
\end{itemize}
\item Supported fields per position:
\begin{itemize}
\item key
\item line
\end{itemize}
\item Out of scope:
\begin{itemize}
\item shadow, gift, and essence text
\item sequence prose
\item semantic states
\end{itemize}
\end{itemize}
\section{Input Contract}
\label{sec:org2cbbb99}
\subsection{Canonical Payload}
\label{sec:org1d558b1}
\begin{itemize}
\item One person per payload.
\item Required fields:
\begin{center}
\begin{tabular}{lll}
field & type & format / rule\\
\hline
birth\textsubscript{date} & string & YYYY-MM-DD\\
birth\textsubscript{time} & string & HH:MM, 24-hour, minute only\\
timezone & string & IANA timezone identifier\\
latitude & number & decimal degrees, -90.0..90.0\\
longitude & number & decimal degrees, -180.0..180.0\\
\end{tabular}
\end{center}
\item Canonical logical shape:
\end{itemize}
\begin{verbatim}
{
  "birth_date": "YYYY-MM-DD",
  "birth_time": "HH:MM",
  "timezone": "Area/Location",
  "latitude": 0.000000,
  "longitude": 0.000000
}
\end{verbatim}
\subsection{Validation Rules}
\label{sec:org93c34bd}
\begin{itemize}
\item Validate before any calculation:
\begin{itemize}
\item presence of all required fields
\item exact field format compliance
\item type compliance
\item numeric range compliance
\item IANA-compliant timezone format
\item Gregorian date validity
\item 24-hour minute time validity
\end{itemize}
\item Strict numeric typing:
\begin{itemize}
\item numeric fields must be numeric values, not strings
\item no silent coercion of numeric-looking strings
\end{itemize}
\item No optional canonical input fields in v1.
\item Extra upstream fields are non-authoritative and must not affect results.
\end{itemize}
\subsection{Normalization Assumptions}
\label{sec:org6493c92}
\begin{itemize}
\item Before engine submission:
\begin{itemize}
\item location already resolved to unique latitude and longitude
\item timezone already resolved to a valid IANA identifier
\item date already resolved to Gregorian YYYY-MM-DD
\item time already normalized to HH:MM
\item ambiguity, alias handling, and UI cleaning already completed upstream
\item payload already reduced to one birth event
\end{itemize}
\end{itemize}
\subsection{Rejection Rules}
\label{sec:org8ced39f}
\begin{itemize}
\item \texttt{incomplete\_input}
\begin{itemize}
\item missing one or more required fields
\end{itemize}
\item \texttt{invalid\_input}
\begin{itemize}
\item malformed date or time
\item invalid timezone string
\item out-of-range latitude or longitude
\item numeric field supplied as string
\end{itemize}
\item \texttt{unsupported\_input}
\begin{itemize}
\item structurally valid input outside supported v1 scope
\end{itemize}
\end{itemize}
\subsection{No Silent Repair}
\label{sec:org8bc81f6}
\begin{itemize}
\item The engine must not silently:
\begin{itemize}
\item infer missing fields
\item correct malformed values
\item coerce ambiguous inputs
\item map timezone aliases
\item resolve place names
\item truncate unexpected time formats
\item substitute defaults
\end{itemize}
\end{itemize}
