specifications/trinity/trinity.tex
\section{Calculation Canon}
\label{sec:orga339fec}
\subsection{Shared Pre-Calculation Steps}
\label{sec:org61486c3}
\begin{itemize}
\item Validate input.
\item Construct local birth datetime from date, time, timezone.
\item Convert to UTC using the pinned timezone standard.
\item Derive Julian Day or equivalent astronomical time input.
\item Use provided latitude and longitude as authoritative coordinates.
\end{itemize}
\subsection{Angular Mechanics}
\label{sec:org879c29f}
\begin{itemize}
\item Canonical longitude range: \texttt{[0.0, 360.0)}.
\item Normalize by modular arithmetic.
\item \texttt{360.0} normalizes to \texttt{0.0}.
\item Opposition derivation uses canonical 180-degree opposition logic.
\item Cyclic interval handling must be deterministic.
\end{itemize}
\subsection{Astrology}
\label{sec:org1ca15cc}
\begin{itemize}
\item Query or derive longitudes at the birth moment.
\item Earth longitude = Sun longitude + 180 degrees modulo 360.
\item Sign placement is derived from the tropical zodiac intervals.
\item House calculation uses:
\begin{itemize}
\item birth moment
\item latitude
\item longitude
\item Placidus
\end{itemize}
\item Return:
\begin{itemize}
\item ascendant
\item midheaven
\item house cusps 1-12
\item supported astrology objects in canonical order
\end{itemize}
\end{itemize}
\subsection{Human Design Design-Time Derivation}
\label{sec:org668f1b0}
\begin{itemize}
\item Design time is a second astronomical moment before birth.
\item Design-time target rule:
\begin{itemize}
\item find the prior moment where Sun longitude is exactly 88.0 degrees earlier than at birth
\item target longitude = normalize(birth\textsubscript{sun}\textsubscript{longitude} - 88.0)
\end{itemize}
\item Search direction:
\begin{itemize}
\item backward in time only
\end{itemize}
\item Initial bracket:
\begin{itemize}
\item centered around approximately 88 days before birth
\end{itemize}
\item Root-finding method:
\begin{itemize}
\item iterative bisection
\end{itemize}
\item Stop conditions:
\begin{itemize}
\item absolute Sun-longitude difference from target < 0.0001 degrees
\item or remaining interval width < 1 second
\end{itemize}
\item Forbidden shortcuts:
\begin{itemize}
\item fixed 88-day subtraction
\item fixed 3-month subtraction
\item rough platform imitation
\item average ephemeris approximation
\item precomputed lookup shortcut
\end{itemize}
\end{itemize}
\subsection{Human Design Gate And Line Mapping}
\label{sec:org09af851}
\begin{itemize}
\item Mandala parameters:
\begin{itemize}
\item anchor defined in Document 06
\item gate width = 5.625 degrees
\item line width = 0.9375 degrees
\item direction = ascending ecliptic longitude
\item intervals are start-inclusive and end-exclusive
\item gate order is a fixed lookup list
\end{itemize}
\item Relative mandala position:
\begin{itemize}
\item normalize longitude
\item subtract canonical anchor
\item normalize result into \texttt{[0.0, 360.0)}
\end{itemize}
\item Gate assignment:
\begin{itemize}
\item floor(relative\textsubscript{position} / 5.625)
\item use result as zero-based index into canonical gate order
\end{itemize}
\item Line assignment:
\begin{itemize}
\item compute offset inside gate segment
\item floor(offset / 0.9375)
\item convert to line number 1..6
\end{itemize}
\item Boundary rule:
\begin{itemize}
\item an interval end belongs to the next segment
\end{itemize}
\item Gene Keys uses exactly the same gate and line results as Human Design.
\end{itemize}
\subsection{Canonical Human Design Gate Order}
\label{sec:orgd62462b}
\begin{itemize}
\item Gate 38 begins at \texttt{277.5°}.
\item Gate 41 begins at \texttt{300.0°}.
\item Canonical 64-gate sequence:
\begin{itemize}
\item {[}38, 54, 61, 60, 41, 19, 13, 49, 30, 55, 37, 63, 22, 36, 25, 17, 21, 51, 42, 3, 27, 24, 2, 23, 8, 20, 16, 35, 45, 12, 15, 52, 39, 53, 62, 56, 31, 33, 7, 4, 29, 59, 40, 64, 47, 6, 46, 18, 48, 57, 32, 50, 28, 44, 1, 43, 14, 34, 9, 5, 26, 11, 10, 58]
\end{itemize}
\end{itemize}
\subsection{Human Design Structural Derivation}
\label{sec:org1166655}
\begin{itemize}
\item Combined activation set:
\begin{itemize}
\item all valid personality activations
\item all valid design activations
\end{itemize}
\item Channels:
\begin{itemize}
\item active only when both gates of a canonical pair are active
\item each active channel returned once
\end{itemize}
\item Centers:
\begin{itemize}
\item defined if they participate in at least one active canonical channel
\item otherwise undefined
\end{itemize}
\item Definition classes:
\begin{itemize}
\item none
\item single
\item split
\item triple\textsubscript{split}
\item quadruple\textsubscript{split}
\end{itemize}
\item Type derivation:
\begin{itemize}
\item reflector if definition = none
\item if sacral defined:
\begin{itemize}
\item manifesting\textsubscript{generator} if at least one motor-to-throat path exists
\item generator otherwise
\end{itemize}
\item if sacral undefined and a non-sacral motor connects to throat:
\begin{itemize}
\item manifestor
\end{itemize}
\item projector otherwise
\end{itemize}
\item Authority derivation priority:
\begin{enumerate}
\item emotional if solar\textsubscript{plexus} defined
\item sacral if type is generator or manifesting\textsubscript{generator}
\item splenic if spleen defined
\item ego\textsubscript{manifested} if type is manifestor and ego defined
\item ego\textsubscript{projected} if type is projector and ego defined
\item self\textsubscript{projected} if type is projector and g defined
\item mental if type is projector
\item lunar if type is reflector
\end{enumerate}
\item Profile:
\begin{itemize}
\item \texttt{personality\_sun\_line/design\_sun\_line}
\end{itemize}
\item Incarnation Cross:
\begin{itemize}
\item structural encoding of personality\textsubscript{sun}, personality\textsubscript{earth}, design\textsubscript{sun}, design\textsubscript{earth}
\item no human-readable cross name required
\end{itemize}
\end{itemize}
\subsection{Gene Keys}
\label{sec:org46ba7cc}
\begin{itemize}
\item life\textsubscript{work} = Personality Sun
\item evolution = Personality Earth
\item radiance = Design Sun
\item purpose = Design Earth
\item Key number equals Human Design gate number.
\item Line equals Human Design line number.
\end{itemize}
\section{Mapping Canon}
\label{sec:orgef5e73f}
\subsection{Astrology Mappings}
\label{sec:org937123d}
\begin{itemize}
\item Sign order:
\begin{itemize}
\item aries, taurus, gemini, cancer, leo, virgo, libra, scorpio, sagittarius, capricorn, aquarius, pisces
\end{itemize}
\item Sign interval rule:
\begin{itemize}
\item each sign spans 30 degrees
\item interval start inclusive, end exclusive
\end{itemize}
\item Astrology object identifiers:
\begin{itemize}
\item sun
\item moon
\item mercury
\item venus
\item mars
\item jupiter
\item saturn
\item uranus
\item neptune
\item pluto
\item chiron
\item north\textsubscript{node}\textsubscript{mean}
\item earth
\end{itemize}
\item House identifiers:
\begin{itemize}
\item integers 1..12
\end{itemize}
\end{itemize}
\subsection{Human Design Centers}
\label{sec:org3304e42}
\begin{itemize}
\item Canonical center list and order:
\begin{enumerate}
\item head
\item ajna
\item throat
\item g
\item ego
\item solar\textsubscript{plexus}
\item sacral
\item spleen
\item root
\end{enumerate}
\item Motor centers:
\begin{itemize}
\item root
\item sacral
\item solar\textsubscript{plexus}
\item ego
\end{itemize}
\end{itemize}
