specifications/trinity/trinity.tex
\subsection{Canonical Channel Table}
\label{sec:org211b370}
\begin{center}
\begin{tabular}{rrrll}
channel\textsubscript{id} & gate\textsubscript{a} & gate\textsubscript{b} & center\textsubscript{a} & center\textsubscript{b}\\
\hline
1-8 & 1 & 8 & g & throat\\
2-14 & 2 & 14 & g & sacral\\
3-60 & 3 & 60 & sacral & root\\
4-63 & 4 & 63 & ajna & head\\
5-15 & 5 & 15 & sacral & g\\
6-59 & 6 & 59 & solar\textsubscript{plexus} & sacral\\
7-31 & 7 & 31 & g & throat\\
9-52 & 9 & 52 & sacral & root\\
10-20 & 10 & 20 & g & throat\\
10-34 & 10 & 34 & g & sacral\\
10-57 & 10 & 57 & g & spleen\\
11-56 & 11 & 56 & ajna & throat\\
12-22 & 12 & 22 & throat & solar\textsubscript{plexus}\\
13-33 & 13 & 33 & g & throat\\
16-48 & 16 & 48 & throat & spleen\\
17-62 & 17 & 62 & ajna & throat\\
18-58 & 18 & 58 & spleen & root\\
19-49 & 19 & 49 & root & solar\textsubscript{plexus}\\
20-34 & 20 & 34 & throat & sacral\\
20-57 & 20 & 57 & throat & spleen\\
21-45 & 21 & 45 & ego & throat\\
23-43 & 23 & 43 & throat & ajna\\
24-61 & 24 & 61 & ajna & head\\
25-51 & 25 & 51 & g & ego\\
26-44 & 26 & 44 & ego & spleen\\
27-50 & 27 & 50 & sacral & spleen\\
28-38 & 28 & 38 & spleen & root\\
29-46 & 29 & 46 & sacral & g\\
30-41 & 30 & 41 & solar\textsubscript{plexus} & root\\
32-54 & 32 & 54 & spleen & root\\
34-57 & 34 & 57 & sacral & spleen\\
35-36 & 35 & 36 & throat & solar\textsubscript{plexus}\\
37-40 & 37 & 40 & solar\textsubscript{plexus} & ego\\
39-55 & 39 & 55 & root & solar\textsubscript{plexus}\\
42-53 & 42 & 53 & sacral & root\\
47-64 & 47 & 64 & ajna & head\\
\end{tabular}
\end{center}
\subsection{Identifier Normalization}
\label{sec:orgb65d28f}
\begin{itemize}
\item Canonical case:
\begin{itemize}
\item lowercase snake\textsubscript{case} for named identifiers
\item integers for gate and line values
\item hyphen-joined ascending gate pairs for channel identifiers
\end{itemize}
\item No alias drift:
\begin{itemize}
\item \texttt{ego} is canonical
\item \texttt{will} must not appear as a separate engine identifier
\end{itemize}
\end{itemize}
\section{Output Contract}
\label{sec:orgb07c0f4}
\subsection{Success Response}
\label{sec:org33105b0}
\begin{itemize}
\item Top-level fields:
\begin{itemize}
\item status
\item metadata
\item input\textsubscript{echo}
\item astrology
\item human\textsubscript{design}
\item gene\textsubscript{keys}
\end{itemize}
\item Success status:
\begin{itemize}
\item \texttt{success}
\end{itemize}
\end{itemize}
\subsection{Metadata}
\label{sec:org244b4ed}
\begin{itemize}
\item Required string fields:
\begin{itemize}
\item engine\textsubscript{version}
\item canon\textsubscript{version}
\item source\textsubscript{stack}\textsubscript{version}
\item input\textsubscript{schema}\textsubscript{version}
\item mapping\textsubscript{version}
\end{itemize}
\item Metadata must not include:
\begin{itemize}
\item random run ids
\item environment names
\item operational log ids
\item timestamps unless later added by canon revision
\end{itemize}
\end{itemize}
\subsection{Input Echo}
\label{sec:org0e07a79}
\begin{itemize}
\item Required fields:
\begin{itemize}
\item birth\textsubscript{date}
\item birth\textsubscript{time}
\item timezone
\item latitude
\item longitude
\end{itemize}
\item Input echo must use canonical formats and must not include excluded intake fields.
\end{itemize}
\subsection{Astrology Output}
\label{sec:org7015eb4}
\begin{itemize}
\item Required sections:
\begin{itemize}
\item system
\item angles
\item house\textsubscript{cusps}
\item objects
\end{itemize}
\item Astrology system values:
\begin{itemize}
\item zodiac = \texttt{tropical}
\item house\textsubscript{system} = \texttt{placidus}
\item node\textsubscript{type} = \texttt{mean}
\end{itemize}
\item Angles:
\begin{itemize}
\item ascendant \{longitude, sign\}
\item midheaven \{longitude, sign\}
\end{itemize}
\item House cusps:
\begin{itemize}
\item ordered houses 1..12
\item each cusp \{house, longitude, sign\}
\end{itemize}
\item Astrology object order:
\begin{enumerate}
\item sun
\item moon
\item mercury
\item venus
\item mars
\item jupiter
\item saturn
\item uranus
\item neptune
\item pluto
\item chiron
\item north\textsubscript{node}\textsubscript{mean}
\item earth
\end{enumerate}
\end{itemize}
\subsection{Human Design Output}
\label{sec:org0dbd91b}
\begin{itemize}
\item Required sections:
\begin{itemize}
\item system
\item personality\textsubscript{activations}
\item design\textsubscript{activations}
\item channels
\item centers
\item definition
\item type
\item authority
\item profile
\item incarnation\textsubscript{cross}
\end{itemize}
\item Human Design system:
\begin{itemize}
\item node\textsubscript{type} = \texttt{true}
\item design\textsubscript{time}\textsubscript{utc}
\end{itemize}
\item Channels:
\begin{itemize}
\item ordered lexicographically by \texttt{channel\_id}
\item each channel \{channel\textsubscript{id}, gate\textsubscript{a}, gate\textsubscript{b}, center\textsubscript{a}, center\textsubscript{b}\}
\end{itemize}
\item Centers:
\begin{itemize}
\item ordered as head, ajna, throat, g, ego, solar\textsubscript{plexus}, sacral, spleen, root
\item each center \{center\textsubscript{id}, state\}
\end{itemize}
\item Allowed definition values:
\begin{itemize}
\item none
\item single
\item split
\item triple\textsubscript{split}
\item quadruple\textsubscript{split}
\end{itemize}
\item Allowed type values:
\begin{itemize}
\item reflector
\item generator
\item manifesting\textsubscript{generator}
\item manifestor
\item projector
\end{itemize}
\item Allowed authority values:
\begin{itemize}
\item emotional
\item sacral
\item splenic
\item ego\textsubscript{manifested}
\item ego\textsubscript{projected}
\item self\textsubscript{projected}
\item mental
\item lunar
\end{itemize}
\end{itemize}
\subsection{Gene Keys Output}
\label{sec:org0381448}
\begin{itemize}
\item Required sections:
\begin{itemize}
\item system
\item activations
\end{itemize}
\item Gene Keys system:
\begin{itemize}
\item derivation\textsubscript{basis} = \texttt{human\_design}
\end{itemize}
\item Activation keys:
\begin{itemize}
\item life\textsubscript{work}
\item evolution
\item radiance
\item purpose
\end{itemize}
\item Each activation = \{key, line\}=.
\end{itemize}
\subsection{Error Output}
\label{sec:org9275160}
\begin{itemize}
\item Top-level fields:
\begin{itemize}
\item status
\item metadata
\item error
\end{itemize}
\item Error status:
\begin{itemize}
\item \texttt{error}
\end{itemize}
\item Error object:
\begin{itemize}
\item error\textsubscript{type}
\item message
\end{itemize}
\item Allowed error types:
\begin{itemize}
\item invalid\textsubscript{input}
\item incomplete\textsubscript{input}
\item unsupported\textsubscript{input}
\item canon\textsubscript{conflict}
\item execution\textsubscript{failure}
\end{itemize}
\end{itemize}
\subsection{Formatting Rules}
\label{sec:org840a52b}
\begin{itemize}
\item Longitude fields:
\begin{itemize}
\item numeric JSON values
\item rounded to 6 decimal places
\end{itemize}
\item \texttt{design\_time\_utc}:
\begin{itemize}
\item ISO 8601 UTC with trailing \texttt{Z}
\item whole-second precision
\end{itemize}
\end{itemize}
\section{Determinism And Versioning}
\label{sec:org0e2a13e}
\begin{itemize}
\item Reproducibility requires identical:
\begin{itemize}
\item normalized input
\item canon\textsubscript{version}
\item source\textsubscript{stack}\textsubscript{version}
\item mapping\textsubscript{version}
\item input\textsubscript{schema}\textsubscript{version}
\item engine\textsubscript{version} where behavior depends on implementation
\end{itemize}
\item No hidden state:
\begin{itemize}
\item no mutable cache state
\item no implicit environment defaults
\item no third-party service responses
\item no stored run history
\end{itemize}
\item Any behavioral change requires:
\begin{itemize}
\item canon review
\item canon revision where applicable
\item regression updates where applicable
\item version impact decision
\end{itemize}
\item Version changes:
\begin{itemize}
\item canon\textsubscript{version} changes for scope, calculation, mapping, output, precedence, formatting, or input behavior changes
\item input\textsubscript{schema}\textsubscript{version} changes for field/format/type/validation changes
\item mapping\textsubscript{version} changes for gate order, channel table, center list, channel-to-center mapping, identifier schemes, or deterministic mapping changes
\item source\textsubscript{stack}\textsubscript{version} changes for authoritative external source changes
\item engine\textsubscript{version} changes for any production implementation change
\end{itemize}
\end{itemize}
